# Group By

In [62]:
import pandas as pd
var = pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c","d"],
                   "S_1":[12,13,14,12,13,14,15,23,25,16,10,34],
                   "S_2":[23,24,25,26,27,28,29,30,25,34,35,56]})
var

   Name  S_1  S_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

In [63]:
var_new = var.groupby("Name")
var_new  #The data values is present is this address

In [64]:
for x,y in var_new:
    print(x)
    print(y)
    print()   
#It will show the full data values

a
  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

b
  Name  S_1  S_2
1    b   13   24
5    b   14   28
7    b   23   30

c
   Name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35

d
   Name  S_1  S_2
3     d   12   26
11    d   34   56

In [65]:
var_new.get_group("a") #It only show the particular data value

  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

In [66]:
var_new.min() #It show the minimum values of the each groups

      S_1  S_2
Name
a      12   23
b      13   24
c      10   25
d      12   26

In [67]:
var_new.max() #It show the maximum values of the each groups

      S_1  S_2
Name
a      25   29
b      23   30
c      16   35
d      34   56

In [68]:
var_new.mean() #It show the mean values of the each groups

            S_1        S_2
Name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

In [69]:
li = list(var_new)
li                     #Convert the DataFrame into list

[('a',
    Name  S_1  S_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    Name  S_1  S_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
     Name  S_1  S_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     Name  S_1  S_2
  3     d   12   26
  11    d   34   56)]